/*
Написать программу которая выводит на экран текст:
    Мое имя: Андрей
    Я живу в городе Берлин
естественно, имя и город должны быть вашеми.
 */


public class Main {
    public static void main(String[] args) {  // method main
        String name = "Nick";
        String city = "Берлин";

        System.out.println("Мое имя: " + name);
        System.out.println("Я живу в городе " + city);
    }
}